In [25]:
import pandas as pd

data = { 'Name': ['Raviteja Beri', 'Iyer Swamy', 'Lalith Mande'],
         'Date': ['2024-05-16','2023-01-23','2022-06-19'],
         'Address': ['Hyderabad, Telangana','East Godavari,Ap','Chennai,Tamilnadu'],
         'Time': ['12:10:15','16:40:22','19:25:55'] }

df=pd.DataFrame(data)

In [27]:
df

            Name        Date               Address      Time
0  Raviteja Beri  2024-05-16  Hyderabad, Telangana  12:10:15
1     Iyer Swamy  2023-01-23      East Godavari,Ap  16:40:22
2   Lalith Mande  2022-06-19     Chennai,Tamilnadu  19:25:55

In [29]:
df[['first_name','last_name']]=df['Name'].str.split(' ', n=1, expand=True)

df['Date']=pd.to_datetime(df['Date'])
df['Year']=df['Date'].dt.year
df['Month']=df['Date'].dt.month
df['Day']=df['Date'].dt.day

df[['Hour','Minute','Seconds']]=df['Time'].str.split(':', expand=True)

print(df)

            Name       Date               Address      Time first_name  \
0  Raviteja Beri 2024-05-16  Hyderabad, Telangana  12:10:15   Raviteja
1     Iyer Swamy 2023-01-23      East Godavari,Ap  16:40:22       Iyer
2   Lalith Mande 2022-06-19     Chennai,Tamilnadu  19:25:55     Lalith

  last_name  Year  Month  Day Hour Minute Seconds
0      Beri  2024      5   16   12     10      15
1     Swamy  2023      1   23   16     40      22
2     Mande  2022      6   19   19     25      55

In [23]:
new_df=['first_name','last_name','Date','Year','Month','Day','Hour','Minute','Seconds']
df=df[new_df]

print(df)

  first_name last_name       Date  Year  Month  Day Hour Minute Seconds
0   Raviteja      Beri 2024-05-16  2024      5   16   12     10      15
1       Iyer     Swamy 2023-01-23  2023      1   23   16     40      22
2     Lalith     Mande 2022-06-19  2022      6   19   19     25      55